# Assignment 1: Data Parsing, Cleansing and Integration
## Task 3
#### Student Name: DENZEL TAN
#### Student ID: s3900098

Date: 31/08.2021

Version: 1.0

Environment: Python 3 and Jupyter notebook

Libraries used: please include the main libraries you used in your assignment, e.g.,:
* pandas
* re
* numpy


## Introduction
Give general information of this assessment here, e.g., what problems you encounter in integration, general steps and solutions you've taken to integrate the data. 

<span style="color: red"> Note that this is a sample notebook only. You will need to fill in the proper markdown and code blocks. You might also want to make necessary changes to the structure to meet your own needs. Note also that any generic comments written in this notebook are to be removed and replace with your own words.</span>

##  Import libraries

In [1]:
# Code to import libraries as you need in this assessment
import numpy as np
import pandas as pd
import datetime
import re

### 1. Examining and loading data
Examine "\<student\_id\>_dataset2.csv" the structure and schema.

In [2]:
# Code to inspect the provided data file
# Couple of notes for all code block in this notebook
## please provide proper comment on your code
## Please re-start and run all cells to make sure codes are runable and include your output in the submission

In [3]:
# Read in the data
df1 = pd.read_csv('s3900098_dataset1_solution.csv')
df2 = pd.read_csv('S3900098_dataset2.csv')
# Show shape and dataframe
print('S1:' + str(df1.shape))
display(df1.head())
print('S2:' + str(df2.shape))
display(df2.head())

S1:(50699, 11)

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,71338111,Allied Health Care Professional : Nurse Manage...,Cornwall,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,32000.0,2012-05-31 15:00:00,2012-06-14 15:00:00,jobs4medical.co.uk
1,71353268,Dental : Registered General Nurse Jobs in Stev...,Hertfordshire,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,22950.0,2013-11-19 00:00:00,2014-01-18 00:00:00,jobs4medical.co.uk
2,69117049,Allied Health Care Professional : Optometrists...,Aberdeenshire,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,34452.2,2013-12-11 15:00:00,2013-12-25 15:00:00,jobs4medical.co.uk
3,68562480,Allied Health Care Professional : Care Home Ma...,Essex,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,50000.0,2012-03-01 00:00:00,2012-03-15 00:00:00,jobs4medical.co.uk
4,69783035,Allied Health Care Professional : Optical Clin...,Aberdeenshire,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,14500.0,2013-11-24 12:00:00,2013-12-08 12:00:00,jobs4medical.co.uk

S2:(5000, 9)

,Job Title,Organisation,Monthly Payment,Contract Type,Category,Closing,Location,Full-Time Equivalent (FTE),Opening
0,Nursing Home Manager Thames Ditton,Liquid Personnel Ltd,2750.00,NaN,Healthcare and Nursing,2013-02-22 15:00:00,Thames Ditton,FULL TIME,2012-12-24 15:00:00
1,Deputy Manager Nursing Home RGN Shrewsbury,Liquid Personnel Ltd,2583.33,NaN,Healthcare and Nursing,2012-11-14 15:00:00,Shrewsbury,FULL TIME,2012-10-15 15:00:00
2,Deputy Manager Nursing Home (RGN) London,Liquid Personnel Ltd,3000.00,NaN,Healthcare and Nursing,2012-12-08 00:00:00,London,FULL TIME,2012-11-08 00:00:00
3,Deputy Manager (RGN) Nursing Home Bristol,Liquid Personnel Ltd,2791.67,NaN,Healthcare and Nursing,2013-01-13 15:00:00,Bristol,FULL TIME,2012-11-14 15:00:00
4,RGN or RMN Wigan,Eden Brown,2240.00,NaN,Healthcare and Nursing,2013-01-24 15:00:00,Wigan,FULL TIME,2012-11-25 15:00:00

In [4]:
print (df1.info())
print (df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50699 entries, 0 to 50698
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50699 non-null  int64
 1   Title         50699 non-null  object
 2   Location      50699 non-null  object
 3   Company       50699 non-null  object
 4   ContractType  50699 non-null  object
 5   ContractTime  50699 non-null  object
 6   Category      50699 non-null  object
 7   Salary        50699 non-null  float64
 8   OpenDate      50699 non-null  object
 9   CloseDate     50699 non-null  object
 10  SourceName    50699 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.3+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Job Title                   5000 non-null   object
 1   Organisation                4937 non-null   object
 2   Monthly Payment             5000 non-null   float64
 3   Contract Type               4312 non-null   object
 4   Category                    5000 non-null   object
 5   Closing                     5000 non-null   object
 6   Location                    5000 non-null   object
 7   Full-Time Equivalent (FTE)  643 non-null    object
 8   Opening                     5000 non-null   object
dtypes: float64(1), object(8)
memory usage: 351.7+ KB
None

### 2. Resolving schema conflicts
Give some general information about the conflicts you found in two schemas and steps you taken to resolve them.

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

#### Conflict 1: XXXX (e.g. naming conflicts in xx column and xx column)
Here give some general information about this conflict.

In [5]:
# Code to inspect data and identify conflicts in schema

Tell me about how you fix the conflict here

In [6]:
# Code to fix the conflict

#### Conflict 2: Title Column

Need to make sure the column is named correctly

In [7]:
df2.columns[0]

'Job Title'

In [8]:
# Renaming
df2.rename(columns = {'Job Title':'Title'}, inplace = True)

In [9]:
# No null values
df2["Title"].isna().sum()

0

#### Conflict 3: Organization/Company Column

Need to make sure the column is named correctly to company

In [10]:
df2.columns[1]

'Organisation'

In [11]:
df2.info()
# So Organization has 50+ missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Title                       5000 non-null   object
 1   Organisation                4937 non-null   object
 2   Monthly Payment             5000 non-null   float64
 3   Contract Type               4312 non-null   object
 4   Category                    5000 non-null   object
 5   Closing                     5000 non-null   object
 6   Location                    5000 non-null   object
 7   Full-Time Equivalent (FTE)  643 non-null    object
 8   Opening                     5000 non-null   object
dtypes: float64(1), object(8)
memory usage: 351.7+ KB

In [12]:
# 63 to be exact
print("There are this many nulls:",df2["Organisation"].isna().sum())
df2[df2["Organisation"].isna()].head()

There are this many nulls: 63

,Title,Organisation,Monthly Payment,Contract Type,Category,Closing,Location,Full-Time Equivalent (FTE),Opening
44,Senior Engineer of Entrance Systems,NaN,4583.33,Permanent,Engineering,2013-09-08 15:00:00,Derbyshire,NaN,2013-08-09 15:00:00
45,Mechanical Design Draftsman,NaN,2291.67,Permanent,Engineering,2013-08-31 00:00:00,Greater Manchester,NaN,2013-07-02 00:00:00
46,ASPnet C Snr Developer,NaN,3666.67,Permanent,Information Technology,2012-05-26 00:00:00,Hampshire,NaN,2012-02-26 00:00:00
47,Procurement Subcontracts Manager,NaN,4791.67,Permanent,Engineering,2013-12-28 12:00:00,Hampshire,NaN,2013-09-29 12:00:00
48,Business Development Coordinator Sussex,NaN,1916.67,Permanent,Teaching,2012-07-29 12:00:00,West Sussex,NaN,2012-04-30 12:00:00

Lets change replace all of it with "non-specified" according to the requirements of the global schema.

In [13]:
df2["Organisation"].fillna('non-specified', inplace = True)
print("There are this many nulls:",df2["Organisation"].isna().sum())

There are this many nulls: 0

Nice it worked. Now lets just change the column name.

In [14]:
# Renaming
df2.rename(columns = {'Organisation':'Company'}, inplace = True)

#### Conflict 4: Monthly Pay Column

Looks like its in monthly... We want annual salary so lets convert that.

In [15]:
# So its already in float format. Good.
print(type(df2["Monthly Payment"][0]))
print(df2["Monthly Payment"].head())

<class 'numpy.float64'>
0    2750.00
1    2583.33
2    3000.00
3    2791.67
4    2240.00
Name: Monthly Payment, dtype: float64

In [16]:
# Nice no missing values
df2["Monthly Payment"].isna().sum()

0

In [17]:
df2["Monthly Payment"] = df2["Monthly Payment"].apply(lambda x: x*12)

In [18]:
# Round to 2 d.p
round(df2["Monthly Payment"],2)
df2["Monthly Payment"].head()

0    33000.00
1    30999.96
2    36000.00
3    33500.04
4    26880.00
Name: Monthly Payment, dtype: float64

Nice. Lets just rename the columns now

In [19]:
# Renaming
df2.rename(columns = {'Monthly Payment':'Salary'}, inplace = True)

#### Conflict 5: Contract Type (ContractTime)

Should be ContractTime, by the contents of the column.

In [20]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Title                       5000 non-null   object
 1   Company                     5000 non-null   object
 2   Salary                      5000 non-null   float64
 3   Contract Type               4312 non-null   object
 4   Category                    5000 non-null   object
 5   Closing                     5000 non-null   object
 6   Location                    5000 non-null   object
 7   Full-Time Equivalent (FTE)  643 non-null    object
 8   Opening                     5000 non-null   object
dtypes: float64(1), object(8)
memory usage: 351.7+ KB

In [21]:
df2["Contract Type"].isna().sum()

688

In [22]:
df2["Contract Type"].value_counts()

Permanent              3720
Fixed Term Contract     592
Name: Contract Type, dtype: int64

So its alrady a String.

We can keep "Permanent". We just change "Fixed Term Contract" to "contract" and make the rest of the nulls "non-specified".

In [23]:
# Replacing Fixed Term Contract

df2["Contract Type"].replace('Fixed Term Contract','contract', inplace = True)
df2["Contract Type"].value_counts()

Permanent    3720
contract      592
Name: Contract Type, dtype: int64

In [24]:
# Replacing the nulls
df2["Contract Type"].fillna('non-specified', inplace = True)
df2["Contract Type"].isna().sum()

0

Beautiful. Lets just change the column names now.

In [25]:
# Renaming
df2.rename(columns = {'Contract Type':'ContractTime'}, inplace = True)

#### Conflict 6: Category Column

Make sure category column has only the valid values in the cells.

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Title                       5000 non-null   object
 1   Company                     5000 non-null   object
 2   Salary                      5000 non-null   float64
 3   ContractTime                5000 non-null   object
 4   Category                    5000 non-null   object
 5   Closing                     5000 non-null   object
 6   Location                    5000 non-null   object
 7   Full-Time Equivalent (FTE)  643 non-null    object
 8   Opening                     5000 non-null   object
dtypes: float64(1), object(8)
memory usage: 351.7+ KB

In [27]:
df2["Category"].value_counts()

Information Technology           1286
Engineering                      1066
Healthcare and Nursing            655
Finance and Accounting            637
Sales                             630
Hospitality and Catering          275
Teaching                          234
PR, Advertising and Marketing     217
Name: Category, dtype: int64

There are only 8 possible categories:
- IT Jobs 
- Healthcare & Nursing Jobs
- Engineering Jobs
- Accounting & Finance Jobs
- Sales Jobs
- Hospitality & Catering Jobs
- Teaching Jobs
- PR, Advertising & Marketing Jobs

They are correct, but it just looks like we just need to help with a little renaming.

Lets start.

In [28]:
df2["Category"].replace('Information Technology','IT Jobs', inplace = True)
df2["Category"].replace('Healthcare and Nursing','Healthcare & Nursing Jobs', inplace = True)
df2["Category"].replace('Engineering','Engineering Jobs', inplace = True)
df2["Category"].replace('Finance and Accounting','Accounting & Finance Jobs', inplace = True)
df2["Category"].replace('Sales','Sales Jobs', inplace = True)
df2["Category"].replace('Hospitality and Catering','Hospitality & Catering Jobs', inplace = True)
df2["Category"].replace('Teaching','Teaching Jobs', inplace = True)
df2["Category"].replace('PR, Advertising and Marketing','PR, Advertising & Marketing Jobs', inplace = True)

In [29]:
df2["Category"].value_counts()

IT Jobs                             1286
Engineering Jobs                    1066
Healthcare & Nursing Jobs            655
Accounting & Finance Jobs            637
Sales Jobs                           630
Hospitality & Catering Jobs          275
Teaching Jobs                        234
PR, Advertising & Marketing Jobs     217
Name: Category, dtype: int64

Nice.

In [30]:
df2["Category"].isna().sum()

0

And since the name is already identical to the correct schema, we won't need to change anything!

#### Conflict 7: Opening/Closing Column (OpenDate/CloseDate)

Change strings to datetime format, and check integrity constraints.

In [31]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Title                       5000 non-null   object
 1   Company                     5000 non-null   object
 2   Salary                      5000 non-null   float64
 3   ContractTime                5000 non-null   object
 4   Category                    5000 non-null   object
 5   Closing                     5000 non-null   object
 6   Location                    5000 non-null   object
 7   Full-Time Equivalent (FTE)  643 non-null    object
 8   Opening                     5000 non-null   object
dtypes: float64(1), object(8)
memory usage: 351.7+ KB

In [32]:
print(type(df2["Opening"][0]))
df2["Opening"][0]

<class 'str'>

'2012-12-24 15:00:00'

In [33]:
df2["Opening"] = pd.to_datetime(df2["Opening"])
df2["Closing"] = pd.to_datetime(df2["Closing"])

In [34]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Title                       5000 non-null   object
 1   Company                     5000 non-null   object
 2   Salary                      5000 non-null   float64
 3   ContractTime                5000 non-null   object
 4   Category                    5000 non-null   object
 5   Closing                     5000 non-null   datetime64[ns]
 6   Location                    5000 non-null   object
 7   Full-Time Equivalent (FTE)  643 non-null    object
 8   Opening                     5000 non-null   datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(6)
memory usage: 351.7+ KB

Perfect. The columns are now in the correct DateTime format.

Lets check for integrity constraints now!

In [35]:
# Example of how closing date should always be bigger than opening date
print(df2["Closing"][0])
print(df2["Opening"][0])

2013-02-22 15:00:00
2012-12-24 15:00:00

In [36]:
# Correct condition
condition = df2["Closing"]>df2["Opening"]

In [37]:
# Anything that doesn't match the correct condition
df2[~condition]

Empty DataFrame
Columns: [Title, Company, Salary, ContractTime, Category, Closing, Location, Full-Time Equivalent (FTE), Opening]
Index: []

Great. Lets just rename the columns now

In [38]:
# Renaming
df2.rename(columns = {'Closing':'CloseDate'}, inplace = True)
# Renaming
df2.rename(columns = {'Opening':'OpenDate'}, inplace = True)

#### Conflict 8: Location (Location)

Check if location is in correct datatype

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Title                       5000 non-null   object
 1   Company                     5000 non-null   object
 2   Salary                      5000 non-null   float64
 3   ContractTime                5000 non-null   object
 4   Category                    5000 non-null   object
 5   CloseDate                   5000 non-null   datetime64[ns]
 6   Location                    5000 non-null   object
 7   Full-Time Equivalent (FTE)  643 non-null    object
 8   OpenDate                    5000 non-null   datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(6)
memory usage: 351.7+ KB

Looks all good. No changes need to be made.

#### Conflict 9: Full-Time Equivalent (ContractType)

Change column name. Convert values to valid values. Fill in missing cells with valid value.

In [40]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Title                       5000 non-null   object
 1   Company                     5000 non-null   object
 2   Salary                      5000 non-null   float64
 3   ContractTime                5000 non-null   object
 4   Category                    5000 non-null   object
 5   CloseDate                   5000 non-null   datetime64[ns]
 6   Location                    5000 non-null   object
 7   Full-Time Equivalent (FTE)  643 non-null    object
 8   OpenDate                    5000 non-null   datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(6)
memory usage: 351.7+ KB

In [41]:
df2['Full-Time Equivalent (FTE)'].value_counts()

FULL TIME    583
0.2 FTE       16
0.6 FTE       15
0.4 FTE       15
0.8 FTE       14
Name: Full-Time Equivalent (FTE), dtype: int64

So we need to convert it to 'full_time' for the FULL TIME values, 'part_time' for any of the FTE values, and then 'non-specified' for the Null values.

In [42]:
# Replacing FULL TIME
df2['Full-Time Equivalent (FTE)'].replace('FULL TIME', 'full_time', inplace=True)

In [43]:
# Replacing all the 0.x FTE
df2['Full-Time Equivalent (FTE)'].replace(['0.2 FTE','0.4 FTE','0.6 FTE','0.8 FTE'], 'part_time', inplace=True)

In [44]:
df2['Full-Time Equivalent (FTE)'].value_counts()

full_time    583
part_time     60
Name: Full-Time Equivalent (FTE), dtype: int64

Lets full the Nulls now.

In [45]:
# Replaceing all the null values
df2['Full-Time Equivalent (FTE)'].fillna('non-specified', inplace = True)

In [46]:
df2['Full-Time Equivalent (FTE)'].isna().sum()

0

Now we just change the column name.

In [47]:
# Renaming
df2.rename(columns = {'Full-Time Equivalent (FTE)':'ContractType'}, inplace = True)

#### Conflict 10: Missing SourceName Column

We need to create a source name column where all sources are `"www.jobhuntlisting.com"`

In [48]:
df2.shape

(5000, 9)

So we need to create a column where there are 5000 rows of the string `"www.jobhuntlisting.com"`

Lets create a list of 5000 strings first, then convert it to a dataframe, then append it.

In [49]:
test = ["www.jobhuntlisting.com","www.jobhuntlisting.com","www.jobhuntlisting.com","www.jobhuntlisting.com","www.jobhuntlisting.com"]

In [50]:
test_df = pd.DataFrame(test)
test_df

                        0
0  www.jobhuntlisting.com
1  www.jobhuntlisting.com
2  www.jobhuntlisting.com
3  www.jobhuntlisting.com
4  www.jobhuntlisting.com

In [51]:
# Making the list
source_list = []
for i in range(5000):
    source_list.append('www.jobhuntlisting.com')

In [52]:
print(len(source_list))
source_list[:5]

5000

['www.jobhuntlisting.com',
 'www.jobhuntlisting.com',
 'www.jobhuntlisting.com',
 'www.jobhuntlisting.com',
 'www.jobhuntlisting.com']

In [53]:
# Checking if DataFrame is correcet
test = pd.DataFrame(source_list)
print(test.shape)
test.head()

(5000, 1)

                        0
0  www.jobhuntlisting.com
1  www.jobhuntlisting.com
2  www.jobhuntlisting.com
3  www.jobhuntlisting.com
4  www.jobhuntlisting.com

Looks good. Lets append it.

In [54]:
# Making the dataframe
df2['SourceName'] = pd.DataFrame(source_list)

In [55]:
df2.head()

,Title,Company,Salary,ContractTime,Category,CloseDate,Location,ContractType,OpenDate,SourceName
0,Nursing Home Manager Thames Ditton,Liquid Personnel Ltd,33000.00,non-specified,Healthcare & Nursing Jobs,2013-02-22 15:00:00,Thames Ditton,full_time,2012-12-24 15:00:00,www.jobhuntlisting.com
1,Deputy Manager Nursing Home RGN Shrewsbury,Liquid Personnel Ltd,30999.96,non-specified,Healthcare & Nursing Jobs,2012-11-14 15:00:00,Shrewsbury,full_time,2012-10-15 15:00:00,www.jobhuntlisting.com
2,Deputy Manager Nursing Home (RGN) London,Liquid Personnel Ltd,36000.00,non-specified,Healthcare & Nursing Jobs,2012-12-08 00:00:00,London,full_time,2012-11-08 00:00:00,www.jobhuntlisting.com
3,Deputy Manager (RGN) Nursing Home Bristol,Liquid Personnel Ltd,33500.04,non-specified,Healthcare & Nursing Jobs,2013-01-13 15:00:00,Bristol,full_time,2012-11-14 15:00:00,www.jobhuntlisting.com
4,RGN or RMN Wigan,Eden Brown,26880.00,non-specified,Healthcare & Nursing Jobs,2013-01-24 15:00:00,Wigan,full_time,2012-11-25 15:00:00,www.jobhuntlisting.com

#### Conflict 10: Generate an ID column that fits with the other Dataset

We need to create an ID column for this dataset that has unique values and doesn't clash with the other dataset

In [56]:
df1.shape

(50699, 11)

In [57]:
df1["Id"]

0        71338111
1        71353268
2        69117049
3        68562480
4        69783035
           ...
50694    68704692
50695    70139229
50696    70960558
50697    72162924
50698    66372417
Name: Id, Length: 50699, dtype: int64

So it has to be 8 digits.

Explanation:

We will make a list of 8 digit Id's which are NOT already taken up by the original ID column in df1

So out of all the values from 00000000 and 99999999, we really only need to select 5000 values which are NOT taken up by df1's Id column. This means we can reduce our search down significently, taking much less time. 

We can just iterate through a range of values, and select all values which are not already in df1. 

Then we can use this list to act as the index for our new df2 Id's.

In [58]:
id_col = df1["Id"].tolist()

In [59]:
# While a small gap in the range, we only need 5000, so this is more than enough
taken_ids = []
free_ids = []
for i in range(12600000,12650000):
    if i not in id_col:
        free_ids.append(i)
    elif i in id_col:
        taken_ids.append(i)

In [60]:
# Lots of free Id's
print(len(free_ids))
print(free_ids[:10])

49995
[12600000, 12600001, 12600002, 12600003, 12600004, 12600005, 12600006, 12600007, 12600008, 12600009]

In [61]:
# Id's that are already taken
taken_ids

[12612628, 12612830, 12612844, 12613049, 12613647]

In [62]:
df1[df1["Id"] == 12612628]

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
7709,12612628,Engineering Systems Analyst,Dorking,Gregory Martin International,non-specified,permanent,Engineering Jobs,25000.0,2012-11-03 00:00:00,2012-12-03 00:00:00,cv-library.co.uk

Ok so the taken_ids is verified to be working.

Lets start creating the index now.

In [63]:
free_ids_5k = free_ids[:5000]
len(free_ids_5k)

5000

In [64]:
# Now lets convert to DataFrame
df2["Id"] = pd.DataFrame(free_ids_5k)
df2.head()

,Title,Company,Salary,ContractTime,Category,CloseDate,Location,ContractType,OpenDate,SourceName,Id
0,Nursing Home Manager Thames Ditton,Liquid Personnel Ltd,33000.00,non-specified,Healthcare & Nursing Jobs,2013-02-22 15:00:00,Thames Ditton,full_time,2012-12-24 15:00:00,www.jobhuntlisting.com,12600000
1,Deputy Manager Nursing Home RGN Shrewsbury,Liquid Personnel Ltd,30999.96,non-specified,Healthcare & Nursing Jobs,2012-11-14 15:00:00,Shrewsbury,full_time,2012-10-15 15:00:00,www.jobhuntlisting.com,12600001
2,Deputy Manager Nursing Home (RGN) London,Liquid Personnel Ltd,36000.00,non-specified,Healthcare & Nursing Jobs,2012-12-08 00:00:00,London,full_time,2012-11-08 00:00:00,www.jobhuntlisting.com,12600002
3,Deputy Manager (RGN) Nursing Home Bristol,Liquid Personnel Ltd,33500.04,non-specified,Healthcare & Nursing Jobs,2013-01-13 15:00:00,Bristol,full_time,2012-11-14 15:00:00,www.jobhuntlisting.com,12600003
4,RGN or RMN Wigan,Eden Brown,26880.00,non-specified,Healthcare & Nursing Jobs,2013-01-24 15:00:00,Wigan,full_time,2012-11-25 15:00:00,www.jobhuntlisting.com,12600004

Our DataFrame 2 is now complete!

In [65]:
df2["ContractTime"].value_counts()

Permanent        3720
non-specified     688
contract          592
Name: ContractTime, dtype: int64

### Adapt Datatypes across schemas S1 and S2

In [66]:
print (df1.info())
print (df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50699 entries, 0 to 50698
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50699 non-null  int64
 1   Title         50699 non-null  object
 2   Location      50699 non-null  object
 3   Company       50699 non-null  object
 4   ContractType  50699 non-null  object
 5   ContractTime  50699 non-null  object
 6   Category      50699 non-null  object
 7   Salary        50699 non-null  float64
 8   OpenDate      50699 non-null  object
 9   CloseDate     50699 non-null  object
 10  SourceName    50699 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.3+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         5000 non-null   object
 1   Company       5000 non-null   object
 2   Salary        5000 non-null   float64
 3   ContractTime  5000 non-null   object
 4   Category      5000 non-null   object
 5   CloseDate     5000 non-null   datetime64[ns]
 6   Location      5000 non-null   object
 7   ContractType  5000 non-null   object
 8   OpenDate      5000 non-null   datetime64[ns]
 9   SourceName    5000 non-null   object
 10  Id            5000 non-null   int64
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 429.8+ KB
None

Looks like we need to convert the OpenDate and CloseDate in df1 to DateTime format.

In [67]:
# Converting to DateTime
df1["OpenDate"] = pd.to_datetime(df1["OpenDate"])
df1["CloseDate"] = pd.to_datetime(df1["CloseDate"])

In [68]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50699 entries, 0 to 50698
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50699 non-null  int64
 1   Title         50699 non-null  object
 2   Location      50699 non-null  object
 3   Company       50699 non-null  object
 4   ContractType  50699 non-null  object
 5   ContractTime  50699 non-null  object
 6   Category      50699 non-null  object
 7   Salary        50699 non-null  float64
 8   OpenDate      50699 non-null  datetime64[ns]
 9   CloseDate     50699 non-null  datetime64[ns]
 10  SourceName    50699 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 4.3+ MB

In [69]:
df1

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,71338111,Allied Health Care Professional : Nurse Manage...,Cornwall,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,32000.0,2012-05-31 15:00:00,2012-06-14 15:00:00,jobs4medical.co.uk
1,71353268,Dental : Registered General Nurse Jobs in Stev...,Hertfordshire,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,22950.0,2013-11-19 00:00:00,2014-01-18 00:00:00,jobs4medical.co.uk
2,69117049,Allied Health Care Professional : Optometrists...,Aberdeenshire,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,34452.2,2013-12-11 15:00:00,2013-12-25 15:00:00,jobs4medical.co.uk
3,68562480,Allied Health Care Professional : Care Home Ma...,Essex,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,50000.0,2012-03-01 00:00:00,2012-03-15 00:00:00,jobs4medical.co.uk
4,69783035,Allied Health Care Professional : Optical Clin...,Aberdeenshire,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,14500.0,2013-11-24 12:00:00,2013-12-08 12:00:00,jobs4medical.co.uk
...,...,...,...,...,...,...,...,...,...,...,...
50694,68704692,Graduate SoftwareWeb Developer,London,UNKNOWN auto added by vacany import,non-specified,non-specified,IT Jobs,25000.0,2012-01-12 12:00:00,2012-03-12 12:00:00,grb.uk.com
50695,70139229,Health & Social Care Tutor/Assessor Bristol,UK,Pursuit Training Ltd,non-specified,permanent,Teaching Jobs,18000.0,2012-08-11 00:00:00,2012-10-10 00:00:00,cvjobstore.com
50696,70960558,Principal Air Consultant Agriculture & Environ...,London,W5 Recruitment,full_time,permanent,Engineering Jobs,52500.0,2012-07-29 15:00:00,2012-08-28 15:00:00,TotallyExec
50697,72162924,Process Engineer All levels,Surrey,Executive Recruitment Services,full_time,permanent,Engineering Jobs,47500.0,2012-03-09 15:00:00,2012-06-07 15:00:00,TotallyExec
50698,66372417,Graduate Engineer (Water industry),South Lanarkshire,Carrington West Limited,full_time,contract,Engineering Jobs,20000.0,2013-01-19 00:00:00,2013-04-19 00:00:00,thegraduate.co.uk

Wonderful.

### 3. Merging data

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

In [70]:
# Checking for the shapes of the dataset. Looks like all the columns are identical!
print(df1.shape)
print(df2.shape)

(50699, 11)
(5000, 11)

In [71]:
# Code to merge two data sets
df = pd.concat([df1,df2])
print(df.shape)
df.sample(10)

(55699, 11)

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
29272,68608609,"Sous Chef Lounge, Bar Restaurant ****k",London,H C Solutions,non-specified,non-specified,Hospitality & Catering Jobs,25000.0,2013-09-28 12:00:00,2013-10-28 12:00:00,MyUkJobs
34613,62114435,German Bilingual Client Services/Sales Executive,London,Language Recruitment Services.,full_time,permanent,Sales Jobs,27500.0,2013-10-29 15:00:00,2013-12-28 15:00:00,fish4.co.uk
26673,69817283,Domiciliary Care Coordinator Bromley London,London,Service Care Solutions,full_time,non-specified,Healthcare & Nursing Jobs,20750.0,2013-05-13 12:00:00,2013-07-12 12:00:00,staffnurse.com
11028,71870406,Producer for leading photography agency,Central London,GRM RECRUITMENT,full_time,permanent,Teaching Jobs,25000.0,2012-01-26 00:00:00,2012-02-25 00:00:00,jobs.guardian.co.uk
20135,69803927,Exhibition Sales Executive International,Redhill,Elizabeth Arnold Associates,non-specified,permanent,"PR, Advertising & Marketing Jobs",30000.0,2013-11-18 00:00:00,2014-02-16 00:00:00,totaljobs.com
4941,70761656,English Language and Literature Teacher,East London,Coen Recruitment Ltd,non-specified,permanent,Teaching Jobs,35000.0,2012-03-11 15:00:00,2012-04-10 15:00:00,cv-library.co.uk
23596,71276705,Food & Beverage Operative,London,Danubius Hotel,non-specified,non-specified,Hospitality & Catering Jobs,12134.0,2013-12-03 00:00:00,2013-12-17 00:00:00,caterer.com
12676,69146204,Business Intelligence Developer Team Lead,London,Accenture,full_time,non-specified,IT Jobs,42502.0,2012-01-27 12:00:00,2012-03-27 12:00:00,Jobcentre Plus
35067,60430366,"Home Manager, Nursing Home, Oakington",Cambridge,non-specified,non-specified,non-specified,Healthcare & Nursing Jobs,34452.2,2013-09-29 00:00:00,2013-10-29 00:00:00,careworx.co.uk
11796,69743316,Statistics Administrator EC****,Central London,BENTLEY ASSOCIATES,full_time,permanent,Accounting & Finance Jobs,34452.2,2012-11-28 12:00:00,2013-01-27 12:00:00,jobs.guardian.co.uk

Nice we got it merged!

......

#### Finding global key for the data
Find a proper global key for the integrated data and give justification here.

In [72]:
# Code to identify global key

.......

### 4. Resolving data conflicts:
Give some general information about the data conflicts you found in the unified table and how you resolve them.

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

#### Conflict 1: Complete Duplications
Here give some general information about this conflict.

In [73]:
# Code to inspect data and identify conflicts in data

In [74]:
### check duplication
duplicates = df[df.duplicated(keep=False)] # showing all duplicated records
print ("There are "+ str(len(duplicates)) + " duplicate records found")
duplicates.sort_values(by=duplicates.columns.tolist()).head(10)

There are 0 duplicate records found

Empty DataFrame
Columns: [Id, Title, Location, Company, ContractType, ContractTime, Category, Salary, OpenDate, CloseDate, SourceName]
Index: []

Looks like we have 0 complete duplicates (where every column value is identical)!

Very Nice. But we are not in the clear yet!

\------------------------------------

#### Conflict 2: Other Duplications
We need to check for duplicates based of two columns. The most logical columns that should be able to uniquely identify a row (besides the Id) is:
- Title + OpenDate + CloseDate

In [75]:
# Title 
cols = ['Title','OpenDate','CloseDate'] # this should uniquely identified a record, as the same bike could not be used by multiple trip started at the same time 
duplicates = df[df.duplicated(cols,keep=False)]
print ("There are "+ str(len(duplicates)) + " duplicate records found")
duplicates.sort_values(by=cols).head(10)

There are 274 duplicate records found

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
14283,72242973,**** x Inner Shield Welders Immediately Required,UK,Proactive Technical Recruitment,non-specified,contract,Engineering Jobs,28800.00,2012-11-24 15:00:00,2012-12-08 15:00:00,totaljobs.com
750,12600750,**** x Inner Shield Welders Immediately Required,UK,Proactive Technical Recruitment,non-specified,contract,Engineering Jobs,28800.00,2012-11-24 15:00:00,2012-12-08 15:00:00,www.jobhuntlisting.com
2901,72479948,3rd Line Support Network Wireless,Nottingham,Hays Corporate Accounts,non-specified,permanent,IT Jobs,42500.00,2013-09-16 12:00:00,2013-11-15 12:00:00,jobsite.co.uk
3240,12603240,3rd Line Support Network Wireless,Nottingham,Hays Corporate Accounts,non-specified,Permanent,IT Jobs,42500.04,2013-09-16 12:00:00,2013-11-15 12:00:00,www.jobhuntlisting.com
37515,72670050,AGM Big High Volume Restaurant London,London,"Appetite4Recruitment High End Restaurants, Pu...",non-specified,non-specified,Hospitality & Catering Jobs,25000.00,2013-03-19 15:00:00,2013-04-02 15:00:00,jobs.catererandhotelkeeper.com
4388,12604388,AGM Big High Volume Restaurant London,London,"Appetite4Recruitment High End Restaurants, P...",non-specified,non-specified,Hospitality & Catering Jobs,24999.96,2013-03-19 15:00:00,2013-04-02 15:00:00,www.jobhuntlisting.com
47237,72484204,ASPNet Developer / PERM / ****k,Cannock,Computer Futures,non-specified,non-specified,IT Jobs,40000.00,2013-04-28 15:00:00,2013-05-28 15:00:00,gojobsearch.co.uk
3365,12603365,ASPNet Developer / PERM / ****k,Cannock,Computer Futures,non-specified,non-specified,IT Jobs,39999.96,2013-04-28 15:00:00,2013-05-28 15:00:00,www.jobhuntlisting.com
48638,72192876,ASPnet C Snr Developer,Hampshire,non-specified,non-specified,permanent,IT Jobs,44000.00,2012-02-26 00:00:00,2012-05-26 00:00:00,jobs.telegraph.co.uk
46,12600046,ASPnet C Snr Developer,Hampshire,non-specified,non-specified,Permanent,IT Jobs,44000.04,2012-02-26 00:00:00,2012-05-26 00:00:00,www.jobhuntlisting.com

In [76]:
df.shape

(55699, 11)

In [77]:
df = df.drop_duplicates(cols, keep='last')
df.shape

(55562, 11)

### 5. Saving the integrated and reshaped data
The last part of the integration process is to export our output data to csv format, named as:
- '\<student\_id\>_dataset_integrated.csv'

In [78]:
# code to save output data
df.to_csv('s3900098_dataset_integrated.csv', index=False)

## Summary of the Assessment Task
Give a short summary and anything you would like to talk about this assessment task here.

Overall, we successfully managed to integrate the data from the 2nd dataset with our original.

Some of the errors solved included:
- Wrong column names
- Data in Alternate formats
- Data spelt differently to global schema
- Missing columns that needed to be generated

However, the tricky aspect of this assignment lied in the creation of a new Id Column, which did not collide with the Original Dataset and also satisfied the required 8 digits.

Thanks for reading and hope you enjoyed - Denzel